---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsLanding.GetConnections
source: html/0a80d27c-a959-a712-6298-de5410502ed8.htm
---
# Autodesk.Revit.DB.Architecture.StairsLanding.GetConnections Method

Returns information about the connections in which the stairs landing participates.

## Syntax (C#)
```csharp
public IList<StairsComponentConnection> GetConnections()
```

## Returns
The connections in which the stairs landing participates.